import "@fortawesome/fontawesome-svg-core/styles.css";
import { faPen } from "@fortawesome/free-solid-svg-icons";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { Noto_Serif_Malayalam } from "next/font/google";
import Image from "next/image";

const notoSansMalayalam = Noto_Serif_Malayalam({ subsets: ["latin"] });
export const metadata = {
  title: "Thelicham Monthly",
};

// or Dynamic metadata
export async function generateMetadata({ params }) {
  return {
    title: `${decodeURIComponent(params.name)} | Thelicham Monthly`,
    
  };
}
export default async function RepoPage({ params: { name } }) {
  const data = [
    {
      title: "വിയോജിപ്പ്: സമവായത്തിന്റെ ഇസ്ലാമിക സാധ്യതകൾ",
      author: "ഷമീർ കെ.എസ്",
      image:
        "https://plus.unsplash.com/premium_photo-1681406994502-bb673c265877?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxlZGl0b3JpYWwtZmVlZHw2M3x8fGVufDB8fHx8&auto=format&fit=crop&w=500&q=60",
      time: "22 june 2022",
      description:
        "ഖുർആനിലെ സൂറത്തുൽ കഹ്ഫ് എല്ലാ വെള്ളിയാഴ്ചയും പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബ് (ശിക്ഷ) ഏശുകയില്ല എന്ന് പ്രവാചക വചനമുണ്ട്. സൂറത്തുൽ കഹ്ഫ് പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബിനെക്കുറിച്ച് ഭൂതോദയം ",
    },
    {
      title: "ഔലിയാപ്പേടി: ഭീതിയുടെ ഖുർആനിക തത്വവിചാരങ്ങൾ",
      author: "ഷമീർ കെ.എസ്",
      image:
        "https://images.unsplash.com/photo-1683661649729-1053579e0d22?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxlZGl0b3JpYWwtZmVlZHwzfHx8ZW58MHx8fHw%3D&auto=format&fit=crop&w=500&q=60",
      time: "22 june 2022",
      description:
        "ഖുർആനിലെ സൂറത്തുൽ കഹ്ഫ് എല്ലാ വെള്ളിയാഴ്ചയും പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബ് (ശിക്ഷ) ഏശുകയില്ല എന്ന് പ്രവാചക വചനമുണ്ട്. സൂറത്തുൽ കഹ്ഫ് പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബിനെക്കുറിച്ച് ഭൂതോദയം ",
    },
    {
      title: "ഔലിയാപ്പേടി: ഭീതിയുടെ ഖുർആനിക തത്വവിചാരങ്ങൾ",
      author: "ഷമീർ കെ.എസ്",
      image:
        "https://images.unsplash.com/photo-1682687981974-c5ef2111640c?ixlib=rb-4.0.3&ixid=MnwxMjA3fDF8MHxlZGl0b3JpYWwtZmVlZHwxMXx8fGVufDB8fHx8&auto=format&fit=crop&w=500&q=60",
      time: "22 june 2022",
      description:
        "ഖുർആനിലെ സൂറത്തുൽ കഹ്ഫ് എല്ലാ വെള്ളിയാഴ്ചയും പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബ് (ശിക്ഷ) ഏശുകയില്ല എന്ന് പ്രവാചക വചനമുണ്ട്. സൂറത്തുൽ കഹ്ഫ് പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബിനെക്കുറിച്ച് ഭൂതോദയം ",
    },
    {
      title: "ഔലിയാപ്പേടി: ഭീതിയുടെ ഖുർആനിക തത്വവിചാരങ്ങൾ",
      author: "ഷമീർ കെ.എസ്",
      image:
        "https://images.unsplash.com/photo-1683526976156-1a3f1a315049?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxlZGl0b3JpYWwtZmVlZHw3Nnx8fGVufDB8fHx8&auto=format&fit=crop&w=500&q=60",
      time: "22 june 2022",
      description:
        "ഖുർആനിലെ സൂറത്തുൽ കഹ്ഫ് എല്ലാ വെള്ളിയാഴ്ചയും പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബ് (ശിക്ഷ) ഏശുകയില്ല എന്ന് പ്രവാചക വചനമുണ്ട്. സൂറത്തുൽ കഹ്ഫ് പതിവാക്കുന്നവർക്ക് അന്ത്യനാളിലെ അദാബിനെക്കുറിച്ച് ഭൂതോദയം ",
    },
  ];
  return (
    <>
      <div>
        <main className="pt-8 pb-16 lg:pt-16 lg:pb-24 bg-white dark:bg-gray-900">
          <article className="max-w-2xl px-6 py-24 mx-auto space-y-12 dark:bg-gray-800 dark:text-gray-50">
            <div className="w-full mx-auto space-y-4 text-center">
              <p className="text-xs font-semibold tracking-wider uppercase">
                #Articles
              </p>
              <h1
                className={`text-4xl font-bold text-red-800 leading-tight md:text-5xl ${notoSansMalayalam.className}`}
              >
                വിയോജിപ്പ്: സമവായത്തിന്റെ ഇസ്ലാമിക സാധ്യതകൾ
              </h1>
              <Image
                src="https://plus.unsplash.com/premium_photo-1681406994502-bb673c265877?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxlZGl0b3JpYWwtZmVlZHw2M3x8fGVufDB8fHx8&auto=format&fit=crop&w=500&q=60"
                alt={"title"}
                className="w-full rounded-[20px]"
                height={400}
                width={400}
              />
              <p className="text-sm dark:text-gray-400">
                <FontAwesomeIcon icon={faPen} className="text-gray-500 mr-2" />
                <a
                  rel="noopener noreferrer"
                  href="#"
                  target="_blank"
                  className="underline dark:text-violet-400"
                >
                  <span className="mr-3">Leroy Jenkins</span>
                </a>
              </p>
              <time>Feb 12th 2021</time>
            </div>
            <div
              className={`dark:text-gray-100 ${notoSansMalayalam.className}`}
            >
              <p>
                സംശയങ്ങൾ പ്രകടിപ്പിക്കുകയും അവക്കുള്ള ഉത്തരങ്ങൾ
                കണ്ടെത്തലുമൊക്കെയാണ് ഇസ്‌ലാമിക ജ്ഞാന സമ്പാദനത്തിന്റെ ഏറ്റവും
                മഹിതമായ ഭാഗമെന്ന് ഞാൻ കരുതുന്നു. ആദ്യവിശ്വാസികളായ സ്വഹാബികൾ
                തങ്ങളുടെ സംശയങ്ങൾ മുഹമ്മദ് നബിയോട് ചോദിക്കുകയും ഉത്തരം
                കണ്ടെത്തുകയുമായിരുന്നു ചെയ്തിരുന്നത്. വിശുദ്ധ ഖുർആനിന്റെ
                വലിയൊരളവോളവും, ഹദീസുകളുടെ വലിയ ഭാഗവും അവരുടെ സംശയങ്ങൾക്കുള്ള
                ഉത്തരങ്ങളടങ്ങിയതായിരുന്നു. മുഹമ്മദ് നബിയുടെ വഫാത്തിനു ശേഷം
                സ്വഹാബികൾ തങ്ങളിൽ നിന്ന് ഏറ്റവും അറിവുള്ള പ്രമുഖരായ സ്വഹാബികളെ
                സമീപിക്കുകയും അവരുടെ സമീപനങ്ങൾ ആരായുകയും ചെയ്തിരുന്നു. പിന്നീട്
                വന്ന സമൂഹം അവരിൽ നിന്ന് പാണ്ഡിത്യമുള്ളവരുമായി തങ്ങളുടെ സംശയങ്ങൾ
                പങ്കുവെച്ചു.
              </p>
              <br />
              <p>
                ഖലീഫ ഉസ്മാൻ(റ)വിന്റെ വധത്തോടെയാണ് ഇസ്‌ലാമിക ലോകത്തെ വലിയ
                പ്രതിസന്ധികൾ രൂപമെടുത്തത്. പ്രവാചകർക്കു ശേഷം ആരാണ്
                നേതൃത്വമേറ്റെടുക്കേണ്ടത് എന്നതു പോലെയുള്ള നിരവധി വിഷയങ്ങളിൽ
                മുസ്‌ലിം സമൂഹം വലിയ രീതിയിലുള്ള സംഘട്ടനത്തിലേർപ്പെട്ടു.
                പലപ്പോഴും അധികാരവടംവലികളായിരുന്നുവെങ്കിൽ അതിനോട് കൂടെ തന്നെ
                ഇസ്‌ലാമിക വൈജ്ഞാനിക മേഖലകളിലേക്കുമായി അവ വഴിമാറി. ഇസ്‌ലാമിന്റെ
                ആദ്യകാലത്ത് ഇസ്‌ലാമിക നിയമങ്ങളുടെ രീതിശാസ്ത്രത്തെക്കുറിച്ചും,
                അവയുടെ സ്വഭാവത്തെക്കുറിച്ചും അടിസ്ഥാന ആശയരൂപീകരണത്തെ
                സംബന്ധിച്ചും, ഹദീസുകളിൽ സ്വീകരണനിരാകരണ മാർഗങ്ങളുടെ മാനദണ്ഡം
                സംബന്ധിച്ചുമെല്ലാമായി വലിയ രീതിയിലുള്ള തർക്കങ്ങളാണ് നടന്നത്.
              </p>
              <br />
              <p>
                സംശയങ്ങൾ പ്രകടിപ്പിക്കുകയും അവക്കുള്ള ഉത്തരങ്ങൾ
                കണ്ടെത്തലുമൊക്കെയാണ് ഇസ്‌ലാമിക ജ്ഞാന സമ്പാദനത്തിന്റെ ഏറ്റവും
                മഹിതമായ ഭാഗമെന്ന് ഞാൻ കരുതുന്നു. ആദ്യവിശ്വാസികളായ സ്വഹാബികൾ
                തങ്ങളുടെ സംശയങ്ങൾ മുഹമ്മദ് നബിയോട് ചോദിക്കുകയും ഉത്തരം
                കണ്ടെത്തുകയുമായിരുന്നു ചെയ്തിരുന്നത്. വിശുദ്ധ ഖുർആനിന്റെ
                വലിയൊരളവോളവും, ഹദീസുകളുടെ വലിയ ഭാഗവും അവരുടെ സംശയങ്ങൾക്കുള്ള
                ഉത്തരങ്ങളടങ്ങിയതായിരുന്നു. മുഹമ്മദ് നബിയുടെ വഫാത്തിനു ശേഷം
                സ്വഹാബികൾ തങ്ങളിൽ നിന്ന് ഏറ്റവും അറിവുള്ള പ്രമുഖരായ സ്വഹാബികളെ
                സമീപിക്കുകയും അവരുടെ സമീപനങ്ങൾ ആരായുകയും ചെയ്തിരുന്നു. പിന്നീട്
                വന്ന സമൂഹം അവരിൽ നിന്ന് പാണ്ഡിത്യമുള്ളവരുമായി തങ്ങളുടെ സംശയങ്ങൾ
                പങ്കുവെച്ചു.
              </p>
              <br />
              <p>
                ഖലീഫ ഉസ്മാൻ(റ)വിന്റെ വധത്തോടെയാണ് ഇസ്‌ലാമിക ലോകത്തെ വലിയ
                പ്രതിസന്ധികൾ രൂപമെടുത്തത്. പ്രവാചകർക്കു ശേഷം ആരാണ്
                നേതൃത്വമേറ്റെടുക്കേണ്ടത് എന്നതു പോലെയുള്ള നിരവധി വിഷയങ്ങളിൽ
                മുസ്‌ലിം സമൂഹം വലിയ രീതിയിലുള്ള സംഘട്ടനത്തിലേർപ്പെട്ടു.
                പലപ്പോഴും അധികാരവടംവലികളായിരുന്നുവെങ്കിൽ അതിനോട് കൂടെ തന്നെ
                ഇസ്‌ലാമിക വൈജ്ഞാനിക മേഖലകളിലേക്കുമായി അവ വഴിമാറി. ഇസ്‌ലാമിന്റെ
                ആദ്യകാലത്ത് ഇസ്‌ലാമിക നിയമങ്ങളുടെ രീതിശാസ്ത്രത്തെക്കുറിച്ചും,
                അവയുടെ സ്വഭാവത്തെക്കുറിച്ചും അടിസ്ഥാന ആശയരൂപീകരണത്തെ
                സംബന്ധിച്ചും, ഹദീസുകളിൽ സ്വീകരണനിരാകരണ മാർഗങ്ങളുടെ മാനദണ്ഡം
                സംബന്ധിച്ചുമെല്ലാമായി വലിയ രീതിയിലുള്ള തർക്കങ്ങളാണ് നടന്നത്.
              </p>
              <br />
              <p>
                സംശയങ്ങൾ പ്രകടിപ്പിക്കുകയും അവക്കുള്ള ഉത്തരങ്ങൾ
                കണ്ടെത്തലുമൊക്കെയാണ് ഇസ്‌ലാമിക ജ്ഞാന സമ്പാദനത്തിന്റെ ഏറ്റവും
                മഹിതമായ ഭാഗമെന്ന് ഞാൻ കരുതുന്നു. ആദ്യവിശ്വാസികളായ സ്വഹാബികൾ
                തങ്ങളുടെ സംശയങ്ങൾ മുഹമ്മദ് നബിയോട് ചോദിക്കുകയും ഉത്തരം
                കണ്ടെത്തുകയുമായിരുന്നു ചെയ്തിരുന്നത്. വിശുദ്ധ ഖുർആനിന്റെ
                വലിയൊരളവോളവും, ഹദീസുകളുടെ വലിയ ഭാഗവും അവരുടെ സംശയങ്ങൾക്കുള്ള
                ഉത്തരങ്ങളടങ്ങിയതായിരുന്നു. മുഹമ്മദ് നബിയുടെ വഫാത്തിനു ശേഷം
                സ്വഹാബികൾ തങ്ങളിൽ നിന്ന് ഏറ്റവും അറിവുള്ള പ്രമുഖരായ സ്വഹാബികളെ
                സമീപിക്കുകയും അവരുടെ സമീപനങ്ങൾ ആരായുകയും ചെയ്തിരുന്നു. പിന്നീട്
                വന്ന സമൂഹം അവരിൽ നിന്ന് പാണ്ഡിത്യമുള്ളവരുമായി തങ്ങളുടെ സംശയങ്ങൾ
                പങ്കുവെച്ചു.
              </p>
              <br />
              <p>
                ഖലീഫ ഉസ്മാൻ(റ)വിന്റെ വധത്തോടെയാണ് ഇസ്‌ലാമിക ലോകത്തെ വലിയ
                പ്രതിസന്ധികൾ രൂപമെടുത്തത്. പ്രവാചകർക്കു ശേഷം ആരാണ്
                നേതൃത്വമേറ്റെടുക്കേണ്ടത് എന്നതു പോലെയുള്ള നിരവധി വിഷയങ്ങളിൽ
                മുസ്‌ലിം സമൂഹം വലിയ രീതിയിലുള്ള സംഘട്ടനത്തിലേർപ്പെട്ടു.
                പലപ്പോഴും അധികാരവടംവലികളായിരുന്നുവെങ്കിൽ അതിനോട് കൂടെ തന്നെ
                ഇസ്‌ലാമിക വൈജ്ഞാനിക മേഖലകളിലേക്കുമായി അവ വഴിമാറി. ഇസ്‌ലാമിന്റെ
                ആദ്യകാലത്ത് ഇസ്‌ലാമിക നിയമങ്ങളുടെ രീതിശാസ്ത്രത്തെക്കുറിച്ചും,
                അവയുടെ സ്വഭാവത്തെക്കുറിച്ചും അടിസ്ഥാന ആശയരൂപീകരണത്തെ
                സംബന്ധിച്ചും, ഹദീസുകളിൽ സ്വീകരണനിരാകരണ മാർഗങ്ങളുടെ മാനദണ്ഡം
                സംബന്ധിച്ചുമെല്ലാമായി വലിയ രീതിയിലുള്ള തർക്കങ്ങളാണ് നടന്നത്.
              </p>
              <br />
              <p>
                സംശയങ്ങൾ പ്രകടിപ്പിക്കുകയും അവക്കുള്ള ഉത്തരങ്ങൾ
                കണ്ടെത്തലുമൊക്കെയാണ് ഇസ്‌ലാമിക ജ്ഞാന സമ്പാദനത്തിന്റെ ഏറ്റവും
                മഹിതമായ ഭാഗമെന്ന് ഞാൻ കരുതുന്നു. ആദ്യവിശ്വാസികളായ സ്വഹാബികൾ
                തങ്ങളുടെ സംശയങ്ങൾ മുഹമ്മദ് നബിയോട് ചോദിക്കുകയും ഉത്തരം
                കണ്ടെത്തുകയുമായിരുന്നു ചെയ്തിരുന്നത്. വിശുദ്ധ ഖുർആനിന്റെ
                വലിയൊരളവോളവും, ഹദീസുകളുടെ വലിയ ഭാഗവും അവരുടെ സംശയങ്ങൾക്കുള്ള
                ഉത്തരങ്ങളടങ്ങിയതായിരുന്നു. മുഹമ്മദ് നബിയുടെ വഫാത്തിനു ശേഷം
                സ്വഹാബികൾ തങ്ങളിൽ നിന്ന് ഏറ്റവും അറിവുള്ള പ്രമുഖരായ സ്വഹാബികളെ
                സമീപിക്കുകയും അവരുടെ സമീപനങ്ങൾ ആരായുകയും ചെയ്തിരുന്നു. പിന്നീട്
                വന്ന സമൂഹം അവരിൽ നിന്ന് പാണ്ഡിത്യമുള്ളവരുമായി തങ്ങളുടെ സംശയങ്ങൾ
                പങ്കുവെച്ചു.
              </p>
              <br />
              <p>
                ഖലീഫ ഉസ്മാൻ(റ)വിന്റെ വധത്തോടെയാണ് ഇസ്‌ലാമിക ലോകത്തെ വലിയ
                പ്രതിസന്ധികൾ രൂപമെടുത്തത്. പ്രവാചകർക്കു ശേഷം ആരാണ്
                നേതൃത്വമേറ്റെടുക്കേണ്ടത് എന്നതു പോലെയുള്ള നിരവധി വിഷയങ്ങളിൽ
                മുസ്‌ലിം സമൂഹം വലിയ രീതിയിലുള്ള സംഘട്ടനത്തിലേർപ്പെട്ടു.
                പലപ്പോഴും അധികാരവടംവലികളായിരുന്നുവെങ്കിൽ അതിനോട് കൂടെ തന്നെ
                ഇസ്‌ലാമിക വൈജ്ഞാനിക മേഖലകളിലേക്കുമായി അവ വഴിമാറി. ഇസ്‌ലാമിന്റെ
                ആദ്യകാലത്ത് ഇസ്‌ലാമിക നിയമങ്ങളുടെ രീതിശാസ്ത്രത്തെക്കുറിച്ചും,
                അവയുടെ സ്വഭാവത്തെക്കുറിച്ചും അടിസ്ഥാന ആശയരൂപീകരണത്തെ
                സംബന്ധിച്ചും, ഹദീസുകളിൽ സ്വീകരണനിരാകരണ മാർഗങ്ങളുടെ മാനദണ്ഡം
                സംബന്ധിച്ചുമെല്ലാമായി വലിയ രീതിയിലുള്ള തർക്കങ്ങളാണ് നടന്നത്.
              </p>
            </div>
            <div className="pt-12 border-t dark:border-gray-700">
              <div className="flex flex-col space-y-4 md:space-y-0 md:space-x-6 md:flex-row">
                <img
                  src="https://source.unsplash.com/75x75/?portrait"
                  alt=""
                  className="self-center flex-shrink-0 w-24 h-24 border rounded-full md:justify-self-start dark:bg-gray-500 dark:border-gray-700"
                />
                <div className="flex flex-col">
                  <h4 className="text-lg font-semibold">Leroy Jenkins</h4>
                  <p className="dark:text-gray-400">
                    Sed non nibh iaculis, posuere diam vitae, consectetur neque.
                    Integer velit ligula, semper sed nisl in, cursus commodo
                    elit. Pellentesque sit amet mi luctus ligula euismod
                    lobortis ultricies et nibh.
                  </p>
                </div>
              </div>
              <div className="flex justify-center pt-4 space-x-4 align-center">
                <a
                  rel="noopener noreferrer"
                  href="#"
                  aria-label="GitHub"
                  className="p-2 rounded-md dark:text-gray-100 hover:dark:text-violet-400"
                >
                  <svg
                    viewBox="0 0 496 512"
                    xmlns="http://www.w3.org/2000/svg"
                    className="w-4 h-4 fill-current"
                  >
                    <path d="M165.9 397.4c0 2-2.3 3.6-5.2 3.6-3.3.3-5.6-1.3-5.6-3.6 0-2 2.3-3.6 5.2-3.6 3-.3 5.6 1.3 5.6 3.6zm-31.1-4.5c-.7 2 1.3 4.3 4.3 4.9 2.6 1 5.6 0 6.2-2s-1.3-4.3-4.3-5.2c-2.6-.7-5.5.3-6.2 2.3zm44.2-1.7c-2.9.7-4.9 2.6-4.6 4.9.3 2 2.9 3.3 5.9 2.6 2.9-.7 4.9-2.6 4.6-4.6-.3-1.9-3-3.2-5.9-2.9zM244.8 8C106.1 8 0 113.3 0 252c0 110.9 69.8 205.8 169.5 239.2 12.8 2.3 17.3-5.6 17.3-12.1 0-6.2-.3-40.4-.3-61.4 0 0-70 15-84.7-29.8 0 0-11.4-29.1-27.8-36.6 0 0-22.9-15.7 1.6-15.4 0 0 24.9 2 38.6 25.8 21.9 38.6 58.6 27.5 72.9 20.9 2.3-16 8.8-27.1 16-33.7-55.9-6.2-112.3-14.3-112.3-110.5 0-27.5 7.6-41.3 23.6-58.9-2.6-6.5-11.1-33.3 2.6-67.9 20.9-6.5 69 27 69 27 20-5.6 41.5-8.5 62.8-8.5s42.8 2.9 62.8 8.5c0 0 48.1-33.6 69-27 13.7 34.7 5.2 61.4 2.6 67.9 16 17.7 25.8 31.5 25.8 58.9 0 96.5-58.9 104.2-114.8 110.5 9.2 7.9 17 22.9 17 46.4 0 33.7-.3 75.4-.3 83.6 0 6.5 4.6 14.4 17.3 12.1C428.2 457.8 496 362.9 496 252 496 113.3 383.5 8 244.8 8zM97.2 352.9c-1.3 1-1 3.3.7 5.2 1.6 1.6 3.9 2.3 5.2 1 1.3-1 1-3.3-.7-5.2-1.6-1.6-3.9-2.3-5.2-1zm-10.8-8.1c-.7 1.3.3 2.9 2.3 3.9 1.6 1 3.6.7 4.3-.7.7-1.3-.3-2.9-2.3-3.9-2-.6-3.6-.3-4.3.7zm32.4 35.6c-1.6 1.3-1 4.3 1.3 6.2 2.3 2.3 5.2 2.6 6.5 1 1.3-1.3.7-4.3-1.3-6.2-2.2-2.3-5.2-2.6-6.5-1zm-11.4-14.7c-1.6 1-1.6 3.6 0 5.9 1.6 2.3 4.3 3.3 5.6 2.3 1.6-1.3 1.6-3.9 0-6.2-1.4-2.3-4-3.3-5.6-2z"></path>
                  </svg>
                </a>
                <a
                  rel="noopener noreferrer"
                  href="#"
                  aria-label="Dribble"
                  className="p-2 rounded-md dark:text-gray-100 hover:dark:text-violet-400"
                >
                  <svg
                    viewBox="0 0 512 512"
                    xmlns="http://www.w3.org/2000/svg"
                    className="w-4 h-4 fill-current"
                  >
                    <path d="M256 8C119.252 8 8 119.252 8 256s111.252 248 248 248 248-111.252 248-248S392.748 8 256 8zm163.97 114.366c29.503 36.046 47.369 81.957 47.835 131.955-6.984-1.477-77.018-15.682-147.502-6.818-5.752-14.041-11.181-26.393-18.617-41.614 78.321-31.977 113.818-77.482 118.284-83.523zM396.421 97.87c-3.81 5.427-35.697 48.286-111.021 76.519-34.712-63.776-73.185-116.168-79.04-124.008 67.176-16.193 137.966 1.27 190.061 47.489zm-230.48-33.25c5.585 7.659 43.438 60.116 78.537 122.509-99.087 26.313-186.36 25.934-195.834 25.809C62.38 147.205 106.678 92.573 165.941 64.62zM44.17 256.323c0-2.166.043-4.322.108-6.473 9.268.19 111.92 1.513 217.706-30.146 6.064 11.868 11.857 23.915 17.174 35.949-76.599 21.575-146.194 83.527-180.531 142.306C64.794 360.405 44.17 310.73 44.17 256.323zm81.807 167.113c22.127-45.233 82.178-103.622 167.579-132.756 29.74 77.283 42.039 142.053 45.189 160.638-68.112 29.013-150.015 21.053-212.768-27.882zm248.38 8.489c-2.171-12.886-13.446-74.897-41.152-151.033 66.38-10.626 124.7 6.768 131.947 9.055-9.442 58.941-43.273 109.844-90.795 141.978z"></path>
                  </svg>
                </a>
                <a
                  rel="noopener noreferrer"
                  href="#"
                  aria-label="Twitter"
                  className="p-2 rounded-md dark:text-gray-100 hover:dark:text-violet-400"
                >
                  <svg
                    viewBox="0 0 512 512"
                    xmlns="http://www.w3.org/2000/svg"
                    className="w-4 h-4 fill-current"
                  >
                    <path d="M459.37 151.716c.325 4.548.325 9.097.325 13.645 0 138.72-105.583 298.558-298.558 298.558-59.452 0-114.68-17.219-161.137-47.106 8.447.974 16.568 1.299 25.34 1.299 49.055 0 94.213-16.568 130.274-44.832-46.132-.975-84.792-31.188-98.112-72.772 6.498.974 12.995 1.624 19.818 1.624 9.421 0 18.843-1.3 27.614-3.573-48.081-9.747-84.143-51.98-84.143-102.985v-1.299c13.969 7.797 30.214 12.67 47.431 13.319-28.264-18.843-46.781-51.005-46.781-87.391 0-19.492 5.197-37.36 14.294-52.954 51.655 63.675 129.3 105.258 216.365 109.807-1.624-7.797-2.599-15.918-2.599-24.04 0-57.828 46.782-104.934 104.934-104.934 30.213 0 57.502 12.67 76.67 33.137 23.715-4.548 46.456-13.32 66.599-25.34-7.798 24.366-24.366 44.833-46.132 57.827 21.117-2.273 41.584-8.122 60.426-16.243-14.292 20.791-32.161 39.308-52.628 54.253z"></path>
                  </svg>
                </a>
                <a
                  rel="noopener noreferrer"
                  href="#"
                  aria-label="Email"
                  className="p-2 rounded-md dark:text-gray-100 hover:dark:text-violet-400"
                >
                  <svg
                    viewBox="0 0 512 512"
                    xmlns="http://www.w3.org/2000/svg"
                    className="w-4 h-4 fill-current"
                  >
                    <path d="M464 64H48C21.49 64 0 85.49 0 112v288c0 26.51 21.49 48 48 48h416c26.51 0 48-21.49 48-48V112c0-26.51-21.49-48-48-48zm0 48v40.805c-22.422 18.259-58.168 46.651-134.587 106.49-16.841 13.247-50.201 45.072-73.413 44.701-23.208.375-56.579-31.459-73.413-44.701C106.18 199.465 70.425 171.067 48 152.805V112h416zM48 400V214.398c22.914 18.251 55.409 43.862 104.938 82.646 21.857 17.205 60.134 55.186 103.062 54.955 42.717.231 80.509-37.199 103.053-54.947 49.528-38.783 82.032-64.401 104.947-82.653V400H48z"></path>
                  </svg>
                </a>
              </div>
            </div>
          </article>
        </main>
        <aside
          aria-label="Related articles"
          className="py-8 lg:py-24 bg-gray-50 dark:bg-gray-800"
        >
          <div className="px-4 mx-auto max-w-screen-xl">
            <h2 className="mb-8 text-2xl font-bold text-gray-900 dark:text-white">
              Related articles
            </h2>
            <div className="grid gap-12 sm:grid-cols-2 lg:grid-cols-4">
              {data.map((item, key) => (
                <article className="max-w-xs">
                  <a href="#">
                    <img
                      src={item.image}
                      className="mb-5 rounded-lg"
                      alt="Image 1"
                    />
                  </a>
                  <h2 className="mb-2 text-xl font-bold leading-tight text-gray-900 dark:text-white">
                    <a href="#" className={notoSansMalayalam.className}>
                      {item.title}
                    </a>
                  </h2>
                  <p className="mb-4 font-light text-gray-500 dark:text-gray-400">
                    {item.author}
                  </p>
                </article>
              ))}
            </div>
          </div>
        </aside>
      </div>
    </>
  );
}
